48/data/attachments/378b843a2447473.txt

INFO     root:api_helper.py:33 Пользователь Laura Palmer зарегистрирован
INFO     root:api_helper.py:33 Пользователь Teresa Harrington зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "394"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Laura Palmer</nif:username>
            <nif:friendToBeRequested>Teresa Harrington</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "421",
  "Date": "Tue, 22 Jul 2025 09:53:40 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>bc4392e8-ce77-4c63-b19c-3bd81c24a25c</ns2:id><ns2:username>Teresa Harrington</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>INVITE_SENT</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "390"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>Teresa Harrington</nif:username>
            <nif:friendToBeAdded>Laura Palmer</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "411",
  "Date": "Tue, 22 Jul 2025 09:53:40 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>1de483ed-c96e-4213-b694-92af86c9cea1</ns2:id><ns2:username>Laura Palmer</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'